{
  "preface": "A long time ago, in a galaxy far far away, I graduated from Franklin High School in 2014, unsure of what I wanted to do. Nothing really interested me in class, or engaged me in a way that made me think, \"hey, this is something I really want to do when I grow up!\". That all changed when I attended college at the University of Washington and took my first intro programming course.",
  "about": "I fell in love with programming immediately. I loved being able to create programs that do cool things, and I loved building projects from scratch. However, I felt like I didn't know much, and the subject is vast and ever growing. Over summer of my freshman year, I took the initiative to learn more programming. I studied web development and mobile development for hours everyday and it fueled my passion even more. In that very moment, I knew I wanted a career as a Software Developer.",
  "about_2": "I am an aspiring engineer who loves to dabble with web technologies. I love working with libraries and frameworks such as React and Node. My current goal is to be able to write really clean code with a solid ecosystem and to have a mastery of a few languages, such as JavaScript, Java, and Python. In my free time, I like to skateboard and play video games.",
  "education": "I studied at the University of Washington and graduated with a degree in Informatics in June, 2019. My focus was mainly on software development and design. Some of those courses included full stack web development, mobile development, and design thinking.",
  "alaskaExperience": [
    "Used Xamarin to develop and maintain cross-platform mobile applications",
    "Worked on a machine learning project to predict flight availability",
    "Developed and maintained REST APIs in C# with the .NET Core framework",
    "Used ASP .NET and SQL Server to provide a platform for employees to schedule and manage tech support appointments"
  ],
  "skills": [
    "Server-side web dev (Node, Express, .NET)",
    "Front-end web dev (React, jQuery)",
    "Mobile dev (Java, Swift, C#)",
    "Data Wrangling (R, Python)"
  ],
  "activities": "When I'm not busy working, I'll most likely be at home playing video games. Some favorites that come to mind are the Assassin's Creed series and The Elder Scrolls Online. If I'm not glued to the screen, I'll either be outside skateboarding or reading a fantasy book.",
  "urls": {
    "github": "https://github.com/yulongtan",
    "linkedin": "https://www.linkedin.com/in/yulongtan/",
    "instagram": "https://www.instagram.com/yulongtango/",
    "befunky": "https://www.befunky.com",
    "i340": "https://info340.github.io/",
    "jobs": "https://github.com/j-delaney/easy-application",
    "di": "https://medium.freecodecamp.org/a-quick-intro-to-dependency-injection-what-it-is-and-when-to-use-it-7578c84fa88f",
    "libgen": "http://gen.lib.rus.ec/",
    "leaflet": "https://leafletjs.com/",
    "stateofjs": "https://stateofjs.com/",
    "classics": "https://www.goodreads.com/shelf/show/greek-classic",
    "classicArch": "https://www.pinterest.com/johnsjenkins/classical-architecture/",
    "poetry": "https://bookriot.com/2018/01/19/short-poems/",
    "reppoem": "https://genius.com/Taylor-swift-why-she-disappeared-poem-annotated"
  },
  "projects": {
    "av": {
      "projectName": "Arcane Vortex",
      "blurb": "Discord bot",
      "desc": "This is a bot that runs on the Discord chatting application. It features funny commands and utilities for the game Elder Scrolls Online.",
      "url": "https://github.com/fu-snail/Arcane-Vortex",
      "tags": ["Node.js", "Discord.js"]
    },
    "bp": {
      "projectName": "Blood Pact",
      "blurb": "Website",
      "desc": "Blood Pact is the website to my INFO 2019 capstone project. The project revolves around building communities for blood donations.",
      "url": "https://github.com/yulongtan/bloodpact",
      "tags": ["React", "JavaScript"]
    },
    "bp_server": {
      "projectName": "Blood Pact Server",
      "blurb": "API",
      "desc": "This is the Node API that is used by the Blood Pact website. It serves blood donation locations and sends texts.",
      "url": "https://github.com/yulongtan/bloodpact-server",
      "tags": ["Node.js", "Express.js", "Firebase"]
    },
    "planc": {
      "projectName": "Plan C",
      "blurb": "iOS App",
      "desc": "This is the fun iOS app for my final project in my Swift class. Plan C is an Uber for X service where X = condoms.",
      "url": "https://github.com/stwahbeh/PlanC",
      "tags": ["iOS", "Google Maps", "Firebase"]
    },
    "linkedqueue": {
      "projectName": "LinkedQueue",
      "blurb": "Data Structure",
      "desc": "This is an earlier project of mine. It's a LinkedList implementation of a Queue data structure and offers many methods.",
      "url": "https://github.com/yulongtan/linkedqueue",
      "tags": ["Java", "Data Structures"]
    },
    "memesquad": {
      "projectName": "Mapping Shootings",
      "blurb": "Maps",
      "desc": "Digital Geographies project focused on mapping out shootings in the US in 2018 with a Twitter #NRA cross-reference.",
      "url": "https://github.com/kuo22/tweet-frequency-map",
      "tags": ["GIS", "Python", "Twitter"]
    },
    "labyrinth": {
      "projectName": "The Labyrinth",
      "blurb": "Android App",
      "desc": "This was my very first Android app that I created. This is a choose-your-own adventure story that resolves around the protagonist (you) trying to make their way out.",
      "url": "https://github.com/yulongtan/labyrinth",
      "tags": ["Android", "Java"]
    },
    "common_cents": {
      "projectName": "Common Cents",
      "blurb": "Android App",
      "desc": "This is the Android app for my final project in Android develoment. This app  makes splitting and managing costs between people much, much easier.",
      "url": "https://github.com/yulongtan/commoncents",
      "tags": ["Android", "Java"]
    },
    "thanos_snap": {
      "projectName": "Thanos Snap",
      "blurb": "Website",
      "desc": "This is a website that lets you upload an image and then performs a Thanos dusting effect (getting snapped) on it This was based off a Red Stapler tutorial.",
      "url": "https://yulongtan.github.io/thanos-snap/",
      "tags": ["JavaScript", "jQuery"]
    }
  }
}